export const greet_message: string  = `
Привет! 👋 Я помогу тебе оформить подписку в наш фитнес-центр.
Выбери тип подписки:
`
export const pay_message: string = `
Спасибо! Всё готово для оформления подписки.
Нажми на кнопку ниже, чтобы перейти к оплате через безопасную систему CloudPayments.
`

export const subscription_variant_one = '💪 Безлимит — 2000 ₽ / мес'
export const subscription_variant_two = '🌞 Дневная карта — 1500 ₽ / мес'

export const enter_personal_info = `Отлично! Теперь мне нужно узнать немного о тебе. Пожалуйста, введи свои данные:`
